<?php

namespace console\controllers;

use common\models\SeoPages;
use common\models\SeoPageTranslate;
use common\models\Translations;
use Stichoza\GoogleTranslate\GoogleTranslate;
use yii\console\Controller;

class XController extends Controller
{
    /**
     * <<<<<<<< ПЕРЕВОД Перевод данных Seo-pages
     */
    public function actionTranslateSeo()
    {
        $pages = SeoPages::find()->all();
        if (!$pages) {
            echo "Page not found.\n";
            return;
        }

        $i = 1;
        foreach ($pages as $page) {

            $sourceLanguage = 'uk'; // Исходный язык
            $targetLanguages = ['ru', 'en']; // Языки перевода

            $tr = new GoogleTranslate();

            foreach ($targetLanguages as $language) {
                $tr->setSource($sourceLanguage);
                $tr->setTarget($language);

                // Перевод текста
                $translatedTitle = $tr->translate($page->title);
                $translatedDescription = $tr->translate($page->description);


                $pageTranslate = new SeoPageTranslate();
                $pageTranslate->language = $language;
                $pageTranslate->page_id = $page->id;
                $pageTranslate->title = $translatedTitle;
                $pageTranslate->description = $translatedDescription;

                if ($pageTranslate->save()) {
                    echo "$i  Тег $page->name переведен и сохранен для $language.\n";
                } else {
                    echo "$i  Ошибка во время сохранения $page->name для $language.\n";
                }
            }
            $i++;
        }
    }

    public function actionPageTranslations()
    {
        $en = ['Мова' => 'Language',
            'Оформлення замовлення' => 'Placing an order',
            'Купити' => 'Buy',
            'відгуків' => 'reviews',
            'Про Нас' => 'About us',
            'Про нас' => 'About us',
            'Контакти' => 'Contacts',
            'Доставка Оплата' => 'Delivery Payment',
            'Доставка та оплата' => 'Delivery & Payment',
            'Статті' => 'Articles',
            'Номер для замовлення' => 'Phone number for ordering',
            'Доставка' => 'Delivery',
            'Нова пошта' => 'Nova Post',
            'Ми працюемо' => 'We work',
            'Пн-Пт 9:00 - 19:00' => 'Mon-Fri 9:00 - 19:00',
            '100% Надійно' => '100% Reliable',
            'Безпечні платежі' => 'Secure payments',
            'Знижки' => 'Discounts',
            'Акційні пропозиції' => 'Promotional offers',
            'Газонна Трава' => 'Lawn grass',
            'Популярні товари' => 'Popular products',
            'Товари для Фермера' => 'Goods for the Farmer',
            'Популярні Категорії' => 'Popular Categories',
            'Товари для Дачі' => 'Goods for the Dacha',
            'Нові надходження' => 'New arrivals',
            'Гербіциди' => 'Herbicides',
            'Фунгіциди' => 'Fungicides',
            'Інсектициди' => 'Insecticides',
            'Ви переглядали' => 'You have viewed',
            'Наші контакти' => 'Our contacts',
            'Інформація' => 'Information',
            'Товари' => 'Goods',
            'Зв\'язок з нами' => 'Contact us',
            'Спеціальні пропозиції' => 'Special proposals',
            'Про доставку' => 'About delivery',
            'Повернення' => 'Return',
            'Каталог' => 'Catalog',
            'Категорії товарів' => 'Product categories',
            'Полтава' => 'Poltava',
            'Валюта' => 'Currency',
            'Під заказ' => 'To order',
            'Очікується' => 'Expected',
            'В наявності' => 'In stock',
            'Відсутній' => 'Missing',
            'Оплата' => 'Payment',
            'Артикул' => 'Code',
            'В кошику' => 'In basket',
            'Товарів' => 'Goods',
            'Пошук товарів' => 'Product search',
            'Головна' => 'Home',
            'Показано' => 'Shown',
            'з' => 'from',
            'товарів з' => 'goods from',
            'товарів' => 'goods',
            'Сортувати' => 'Sort',
            'Показати' => 'Show',
            'Продукти запиту' => 'Request products',
            'Категорії' => 'Categories',
            'Опис' => 'Description',
            'Аналог' => 'Analogue',
            'Характеристики' => 'Characteristics',
            'Відгуки' => 'Reviews',
            'Опис, інструкція товару' => 'Product description, instructions',
            'Розгорнути опис' => 'Show description',
            'Приховати опис' => 'Hide description',
            'Супутні товари' => 'Associated goods',
            'Відгуки про' => 'Reviews about',
            'Аналог товару' => 'Analogue product',
            'Залишити відгук' => 'Leave a review',
            'Дивитись всі' => 'Watch all',
            'Наявність' => 'Availability',
            'Ціна Дешевші' => 'Price Cheaper',
            'Ціна Дорожчі' => 'Price Expensive',
            'Назва A-я' => 'Name A-z',
            'Назва Я-а' => 'Name Z-a',
            'Зображення' => 'Image',
            'Товар' => 'Product',
            'Ціна' => 'Price',
            'К-ть' => 'Qty',
            'Всього' => 'In total',
            'Замовлення від' => 'Order from',
            'Загальна сума' => 'Total',
            'Оформити замовлення' => 'To order',
            'Дивитись товари' => 'See products',
            'Ваш кошик порожній' => 'Your basket is empty',
            'Ваш кошик' => 'Your shopping cart',
            'Інформація для доставки' => 'Shipping information',
            'Самовивіз' => 'Pickup',
            'Нова Пошта' => 'Nova Post',
            'Область' => 'Region',
            'Місто' => 'City',
            'Відділення' => 'Department',
            'Укрпошта' => 'Ukrposhta',
            'Відправка при 100% оплаті за замовлення!!!' => 'Shipping with 100% payment for the order!!!',
            'Для доставки "Укрпошта" введіть в полі коментар такі дані' => 'For "Ukrposhta" delivery, enter the following data in the comment field',
            'Індекс' => 'Index',
            'Район' => 'Area',
            'Місто/Смт (село)' => 'City/town (village)',
            'Для прикладу' => 'For example',
            'Полтавська, Кременчуцький, м.Кременчук' => '',
            'Ваше замовлення' => 'Your order',
            'Зробити замовлення' => 'Make an order',
            'Виберіть відділення...' => 'Select department...',
            'Виберіть місто...' => 'Choose a city...',
            'Виберіть область...' => 'Select an area...',
            'Фільтр' => 'Filter',
            'Фільтрувати' => 'Filter',
            'Скинути' => 'Cast',
            'Меню' => 'Menu',
            'Порівняння' => 'Comparison',
            'Порівняння товарів' => 'Product comparison',
            'Список порівняння порожній!' => 'The comparison list is empty!',
            'Додайте товари для порівняння.' => 'Add products to compare.',
            'Спробуйте скористатися пошуком.' => 'Try using search.',
            'Або перейдіть на головну сторінку, щоб почати все спочатку.' => 'Or go to the main page to start over.',
            'На Головну Сторінку' => 'To the Main Page',
            'Видалити' => 'Remove',
            'Продукт' => 'Product',
            'Список Бажань' => 'Wish list',
            'Додайте товари до списку бажань.' => 'Add items to your wish list.',
            'Список бажань порожній!' => 'Wish list is empty!',
            'Може зацікавити' => 'May be of interest',
            'Останні статті' => 'Latest articles',
            'Хмара тегів' => 'Tag cloud',
            'Статті та поради' => 'Articles and tips',
            'Докладніше...' => 'Read more...',
            'Пошук статтів...' => 'Search articles...',
            'Залиште нам повідомлення' => 'Leave us a message',
            'Вітаемо Ваше повідомлення -- надіслане !!!' => 'Congratulations Your message has been sent !!!',
            'Ваше ім’я' => 'Your name',
            'Вкажіть будь ласка Ваше ім’я' => 'Please enter your name',
            'Адреса електронної пошти' => 'Email address',
            'Вкажіть будь ласка Ваш email' => 'Please enter your email',
            'Тема' => 'Subject',
            'Вкажіть будь ласка Тему' => 'Please specify the topic',
            'Повідомлення' => 'Message',
            'Напишіть будь ласка Ваше повідомлення' => 'Please write your message',
            'Відправити' => 'Send',
            'Зв’язок з нами' => 'Contact us',
            'Наша адреса' => 'Our addresses',
            'Телефон' => 'Telephone',
            'Години роботи' => 'Hours of work',
            'Підписатись' => 'Subscribe',
            'Електронна адреса...' => 'E-mail address...',
            'Підпишіться на нашу розсилку новин.' => 'Subscribe to our newsletter.',
            'Новини' => 'News',];

        $ru = [ 'Мова' => 'Язык',
            'Оформлення замовлення' => 'Оформление заказа',
            'Купити' => 'Купить',
            'відгуків' => 'отзывов',
            'Про Нас' => 'О нас',
            'Про нас' => 'О нас',
            'Контакти' => 'Контакты',
            'Доставка Оплата' => 'Доставка Оплата',
            'Доставка та оплата' => 'Доставка и Оплата',
            'Статті' => 'Статьи',
            'Номер для замовлення' => 'Номер для заказа',
            'Доставка' => 'Доставка',
            'Нова пошта' => 'Новая почта',
            'Ми працюемо' => 'Мы работаем',
            'Пн-Пт 9:00 - 19:00' => 'Пн-Пт 9:00 - 19:00',
            '100% Надійно' => '100% Надежно',
            'Безпечні платежі' => 'Безопасные платежи',
            'Знижки' => 'Скидки',
            'Акційні пропозиції' => 'Акционные предложения',
            'Газонна Трава' => 'Газонная трава',
            'Популярні товари' => 'Популярные товары',
            'Товари для Фермера' => 'Товары для Фермера',
            'Популярні Категорії' => 'Популярные Категории',
            'Товари для Дачі' => 'Товары для Дачи',
            'Нові надходження' => 'Новые поступления',
            'Гербіциди' => 'Гербициды',
            'Фунгіциди' => 'Фунгициды',
            'Інсектициди' => 'Инсектициды',
            'Ви переглядали' => 'Вы просматривали',
            'Наші контакти' => 'Наши контакты',
            'Інформація' => 'Информация',
            'Товари' => 'Товары',
            'Зв\'язок з нами' => 'Связь с нами',
            'Спеціальні пропозиції' => 'Специальные предложения',
            'Про доставку' => 'Про доставку',
            'Повернення' => 'Возврат',
            'Каталог' => 'Каталог',
            'Категорії товарів' => 'Категории товаров',
            'Полтава' => 'Полтава',
            'Валюта' => 'Валюта',
            'Під заказ' => 'Под заказ',
            'Очікується' => 'Ожидается',
            'В наявності' => 'В наличии',
            'Відсутній' => 'Отсутствует',
            'Оплата' => 'Оплата',
            'Артикул' => 'Артикул',
            'В кошику' => 'В корзине',
            'Товарів' => 'Товаров',
            'Пошук товарів' => 'Поиск товаров',
            'Головна' => 'Главная',
            'Показано' => 'Показано',
            'товарів з' => 'товаров из',
            'з' => 'из',
            'товарів' => 'товаров',
            'Сортувати' => 'Сортировать',
            'Показати' => 'Показать',
            'Продукти запиту' => 'Продукты запроса',
            'Категорії' => 'Категории',
            'Опис' => 'Описание',
            'Аналог' => 'Аналог',
            'Характеристики' => 'Характеристики',
            'Відгуки' => 'Отзывы',
            'Опис, інструкція товару' => 'Описание, инструкция товара',
            'Розгорнути опис' => 'Показать описание',
            'Приховати опис' => 'Скрыть описание',
            'Супутні товари' => 'Сопутствующие товары',
            'Відгуки про' => 'Отзывы о',
            'Аналог товару' => 'Аналог товара',
            'Залишити відгук' => 'Оставить отзыв',
            'Дивитись всі' => 'Смотреть все',
            'Наявність' => 'Наличие',
            'Ціна Дешевші' => 'Цена Дешевле',
            'Ціна Дорожчі' => 'Цена Дороже',
            'Назва A-я' => 'Название A-я',
            'Назва Я-а' => 'Название Я-а',
            'Зображення' => 'Фото',
            'Товар' => 'Товар',
            'Ціна' => 'Цена',
            'К-ть' => 'К-во',
            'Всього' => 'Всего',
            'Замовлення від' => 'Заказ от',
            'Загальна сума' => 'Общая сумма',
            'Оформити замовлення' => 'Оформить заказ',
            'Дивитись товари' => 'Смотреть товары',
            'Ваш кошик порожній' => 'Ваша корзина пуста',
            'Ваш кошик' => 'Ваша корзина',
            'Інформація для доставки' => 'Информация для доставки',
            'Самовивіз' => 'Самовывоз',
            'Нова Пошта' => 'Новая почта',
            'Область' => 'Область',
            'Місто' => 'Город',
            'Відділення' => 'Отделение',
            'Укрпошта' => 'Укрпочта',
            'Відправка при 100% оплаті за замовлення!!!' => 'Отправка при 100% оплате за заказ!!!',
            'Для доставки "Укрпошта" введіть в полі коментар такі дані' => 'Для доставки "Укрпочта" введите в поле комментарий следующие данные',
            'Індекс' => 'Индекс',
            'Район' => 'Район',
            'Місто/Смт (село)' => 'Город/Смт (село)',
            'Для прикладу' => 'Для примера',
            'Полтавська, Кременчуцький, м.Кременчук' => 'Полтавская, Кременчугский, г.Кременчуг',
            'Ваше замовлення' => 'Ваш заказ',
            'Зробити замовлення' => 'Сделать заказ',
            'Виберіть відділення...' => 'Выберите отделение...',
            'Виберіть місто...' => 'Выберите город...',
            'Виберіть область...' => 'Выберите область...',
            'Фільтр' => 'Фильтр',
            'Фільтрувати' => 'Фильтровать',
            'Скинути' => 'Сбросить',
            'Меню' => 'Меню',
            'Порівняння' => 'Сравнение',
            'Порівняння товарів' => 'Сравнение товаров',
            'Список порівняння порожній!' => 'Список сравнения пуст!',
            'Додайте товари для порівняння.' => 'Разместите товары для сравнения.',
            'Спробуйте скористатися пошуком.' => 'Попытайтесь воспользоваться поиском.',
            'Або перейдіть на головну сторінку, щоб почати все спочатку.' => 'Или перейдите на главную страницу, чтобы начать все сначала.',
            'На Головну Сторінку' => 'На главную страницу',
            'Видалити' => 'Удалить',
            'Продукт' => 'Продукт',
            'Список Бажань' => 'Список Желаний',
            'Додайте товари до списку бажань.' => 'Добавьте товары в список желаний.',
            'Список бажань порожній!' => 'Список желаний пуст!',
            'Може зацікавити' => 'Может заинтересовать',
            'Останні статті' => 'Последние статьи',
            'Хмара тегів' => 'Облако тегов',
            'Статті та поради' => 'Статьи и советы',
            'Докладніше...' => 'Подробнее...',
            'Пошук статтів...' => 'Поиск статей...',
            'Залиште нам повідомлення' => 'Оставьте нам сообщение',
            'Вітаемо Ваше повідомлення -- надіслане !!!' => 'Приветствуем Ваше сообщение – отправлено!!!',
            'Ваше ім’я' => 'Ваше имя',
            'Вкажіть будь ласка Ваше ім’я' => 'Укажите, пожалуйста, Ваше имя',
            'Адреса електронної пошти' => 'Адрес электронной почты',
            'Вкажіть будь ласка Ваш email' => 'Укажите, пожалуйста, Ваш email',
            'Тема' => 'Тема',
            'Вкажіть будь ласка Тему' => 'Укажите пожалуйста Тему',
            'Повідомлення' => 'Сообщение',
            'Напишіть будь ласка Ваше повідомлення' => 'Напишите пожалуйста Ваше сообщение',
            'Відправити' => 'Отправить',
            'Зв’язок з нами' => 'Связь с нами',
            'Наша адреса' => 'Наш адреса',
            'Телефон' => 'Телефон',
            'Години роботи' => 'Часы работы',
            'Підписатись' => 'Подписаться',
            'Електронна адреса...' => 'Электронный адрес...',
            'Підпишіться на нашу розсилку новин.' => 'Подпишитесь на нашу рассылку новостей.',
            'Новини' => 'Новости'];

        foreach ($en as $message => $translation) {
            $model = new Translations();
            $model->category = 'app';
            $model->message = $message;
            $model->translation = $translation;
            $model->language = 'en';
            $model->save();
        }

        foreach ($ru as $message => $translation) {
        $model = new Translations();
        $model->category = 'app';
        $model->message = $message;
        $model->translation = $translation;
        $model->language = 'ru';
        $model->save();
        }
    }

}
